def solution(letter):
    answer = ''

    # 딕셔너리 생성 (키, 값 저장)
    morse = { 
        '.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
        '-.--':'y','--..':'z'
    }

    str = letter.split(' ')

    for i in str:
        # 딕셔너리의 키에 해당하는 값을 가져와 합치기
        answer += morse[i]

    return answer
